app/views/network_participations/_network_participation_status.html.erb

<% if current_user.networks.empty? %>
---
SELECT COUNT(*) FROM `networks` INNER JOIN `network_participations` ON `networks`.`id` = `network_participations`.`network_id` WHERE `network_participations`.`user_id` = 1

		<div class="network-control">
			<%= link_to "", current_user.network_participations.find_by_network_id(network.id),
			:method => :delete, :remote => true, :confirm => "정말로 #{network.name} 네트워크를 탈퇴하시겠습니까?", :class => "network-delete" %>
---
SELECT 1 FROM `network_participations` WHERE (`network_participations`.`user_id` = BINARY 1 AND `network_participations`.`network_id` IS NULL) LIMIT 1
SELECT `networks`.* FROM `networks` WHERE `networks`.`name` = '항공' ORDER BY networks.network_participations_count DESC, networks.created_at LIMIT 1