app/controllers/kits_controller.rb

  def index
    @title = "시내 | 이야기로 성장하는 네트워크"
    @description ="강연, 스터디, 여행, 독서, 연애, 취업 - 매일 매일 참여하고 공유하며 서로 성장하는 응원과 이야기들"
    @revisit_after = "1 days"
    if user_signed_in?
      @kit = current_user.kits.build
    end
    if params[:search]
      @search = Kit.search do
        fulltext params[:search]
        paginate(:page => params[:page], :per_page => 20)
      end
      @kits = @search.results
    else
      @kits = Kit.order("id").page(params[:page]).per_page(20)
---
SELECT `kits`.* FROM `kits` ORDER BY kits.updated_at DESC, id LIMIT 20 OFFSET 0

  def create
    @kit = current_user.authored_kits.build(params[:kit])

    if @kit.save
---
INSERT INTO `kits` (`content`, `created_at`, `kitable_id`, `kitable_type`, `photo_content_type`, `photo_file_name`, `photo_file_size`, `updated_at`, `user_id`) VALUES ('ㅁㄴㅇㄹ', '2012-04-18 23:21:00', 1, 'User', NULL, NULL, NULL, '2012-04-18 23:21:00', 1)