app/controllers/networks_controller.rb

SELECT `users`.* FROM `users` ORDER BY users.avatar_content_type is not NULL DESC, users.updated_at DESC, id LIMIT 30 OFFSET 0
SELECT `networks`.* FROM `networks` WHERE (name like '%항공%') ORDER BY networks.network_participations_count DESC, networks.created_at, name
SELECT `networks`.* FROM `networks` ORDER BY networks.network_participations_count DESC, networks.created_at, name
---
  def index
    @title = "사람들 | 함께 꿈을 실현하는 친구들"
    @description ="함께 꾸는 꿈은 현실이 된다. 서로의 관심사와 이야기거리를 발견하고 함께 꿈을 이룰 멘토, 멘티, 친구들을 발견할 수 있는 공간"
    @users = User.order("id").page(params[:page]).per_page(30)
    @networks_all = Network.order(:name).where("name like ?", "%#{params[:term]}%")
    respond_to do |format|
      format.html
      format.js
      format.json {render :json => @networks_all.map(&:name) }