app/controllers/network_participations_controller.rb

SELECT `networks`.* FROM `networks` WHERE `networks`.`name` = '항공' ORDER BY networks.network_participations_count DESC, networks.created_at LIMIT 1
SELECT 1 FROM `network_participations` WHERE (`network_participations`.`user_id` = BINARY 1 AND `network_participations`.`network_id` IS NULL) LIMIT 1
SELECT COUNT(*) FROM `networks` INNER JOIN `network_participations` ON `networks`.`id` = `network_participations`.`network_id` WHERE `network_participations`.`user_id` = 1
---
  def create
    @network_participation = current_user.network_participations.build(params[:network_participation])
    if !Network.find_by_name(params[:network_participation][:network_name]).nil?
      @network_participation.network_id = Network.find_by_name(params[:network_participation][:network_name]).id
    end
    respond_to do |format|
      if @network_participation.save
        if Authentication.have_facebook_id(current_user)
          @network = @network_participation.network
          @graph.put_wall_post("드림킷에서 '#{@network.name}' 네트워크에 참여했습니다.", {
            :name => "#{@network.name} 네트워크",
            :description => "총 #{@network.network_participations.count}명의 사람들이 함께하고 있습니다.",
            :picture => "http://www.dreamkit.net/assets/logo.png",
            :link => request.protocol + request.host + network_path(@network)
          })