app/controllers/registrations_controller.rb

INSERT INTO `notification_settings` (`comment_notify`, `created_at`, `friendship_acceptance_notify`, `friendship_notify`, `kit_notify`, `moim_kit_notify`, `other_comment_notify`, `reply_notify`, `seed_kit_notify`, `updated_at`, `user_id`) VALUES (1, '2012-04-18 23:19:54', 1, 1, 1, 1, 1, 1, 1, '2012-04-18 23:19:54', 1)
INSERT INTO `users` (`admin`, `avatar_content_type`, `avatar_file_name`, `avatar_file_size`, `birthday`, `cellphone`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `interest_id`, `last_sign_in_at`, `last_sign_in_ip`, `major_detail`, `major_id`, `name`, `password_salt`, `profile`, `remember_created_at`, `remember_token`, `reset_password_sent_at`, `reset_password_token`, `sex`, `sign_in_count`, `updated_at`) VALUES (0, NULL, NULL, NULL, NULL, NULL, '2012-04-18 23:19:54', NULL, NULL, 'dean1@headflow.net', '318e93f3bb6654fc7796417a8002a2bcf2e01c12', NULL, NULL, NULL, NULL, NULL, 'dean', 'sHMiWah3zn3ZUf1mC4X7', NULL, NULL, NULL, NULL, NULL, NULL, 0, '2012-04-18 23:19:54')
---
  def create
    super
    if user_signed_in? and current_user.notification_setting.nil?
      NotificationSetting.create!(:user_id => current_user.id)