app/controllers/seeds_controller.rb

  def index
    @title ="DreamKit | 꿈이 현실이 되는 공간"
    @description ="혼자 꾸는 꿈은 꿈일 뿐이지만, 함께 꾸는 꿈은 현실이 된다. 다양한 꿈을 가진 사람들과 함께 계획하고 실천하는 공간. 누구나 이루고 싶은 목표를 시드로 만들어 공유-참여-응원하여 모두의 꿈을 실현하는 열린 커뮤니티"
    @revisit_after = "1 days"
    if params[:search]
      @search = Seed.search do
        fulltext params[:search]
        paginate(:page => params[:page], :per_page => 20)
      end
      @seeds = @search.results
    else
      @seeds = Seed.order("id").page(params[:page]).per_page(20)
---
SELECT `seeds`.* FROM `seeds` ORDER BY seeds.updated_at DESC
SELECT `seeds`.* FROM `seeds` ORDER BY seeds.updated_at DESC, id LIMIT 20 OFFSET 0

  def create
    @seed = current_user.seeds.build(params[:seed])
    if @seed.save
---
INSERT INTO `seeds` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2012-04-18 23:20:28', 'gkgk', 'gkgk', '2012-04-18 23:20:28', 1)