app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY users.avatar_content_type is not NULL DESC, users.updated_at DESC LIMIT 1
SELECT COUNT(*) FROM `authentications` WHERE `authentications`.`user_id` = 1 AND `authentications`.`provider` = 'facebook'
SELECT `kits`.* FROM `kits` WHERE `kits`.`kitable_id` = 1 AND `kits`.`kitable_type` = 'User' ORDER BY kits.updated_at DESC LIMIT 10 OFFSET 0
---
  def show
    @user = User.find(params[:id])
    @title = @user.name
    @description =""
    @kits = @user.kits.page(params[:page]).per_page(10)
    @kit = Kit.new(:kitable_id => @user.id, :kitable_type => "User")

    if !@user.authentications.where(:provider => "facebook").empty?

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY users.avatar_content_type is not NULL DESC, users.updated_at DESC LIMIT 1
UPDATE `users` SET `profile` = 'a', `updated_at` = '2012-04-18 23:20:01' WHERE `users`.`id` = 1
---
  def update
    @user = User.find(params[:id])
    @user.update_attributes(params[:user])