app/views/layouts/_header_seed_index.html.erb

SELECT `seeds`.* FROM `seeds` ORDER BY seeds.updated_at DESC
---
		<div class="item-box">
			<% Seed.all.shuffle.first(20).each do |seed| %>