app/views/layouts/_sidebar_users.html.erb

SELECT `majors`.* FROM `majors`
---
				<% majors = []%>
				<% Major.all.each do |major|%>

SELECT `interests`.* FROM `interests`
---
				<% interests = []%>
				<% Interest.all.each do |interest|%>