app/views/layouts/_sidebar_seeds.html.erb

		</div>
		<% unless current_user.progress_seeds.empty? %>
---
SELECT `seeds`.* FROM `seeds` ORDER BY seeds.updated_at DESC