app/views/layouts/_sidebar_networks.html.erb

SELECT `networks`.* FROM `networks` ORDER BY networks.network_participations_count DESC, networks.created_at, name
---
		<i class="nav-search"></i>
		<%= text_field_tag :search, params[:search], data: {autocomplete_source: Network.order(:name).map(&:name)}, :id => 'network-search' %>